import { configureStore } from '@reduxjs/toolkit';
// Эта функция упрощает создание Redux store, предоставляя удобные
// настройки и улучшенные возможности по сравнению с традиционным подходом.
import todoReducer from './features/todoSlice';
import filterReducer from './features/filterSlice';

// Здесь мы импортируем редьюсер, который называется todoReducer, из файла todoSlice.js, 
// находящегося в папке features. Редьюсер — это функция, которая принимает текущее
//  состояние и действие, а затем возвращает новое состояние. В данном случае
//   todoReducer будет обрабатывать действия, связанные с задачами (todos).


const store = configureStore({
  reducer: {
    todos: todoReducer,
    activeFilter: filterReducer,
  },
});
// - Мы создаем переменную store, в которой будет храниться наш Redux store. 
// - Вызываем функцию configureStore, передавая ей объект с настройками.
// - В объекте мы указываем свойство reducer, которое содержит объект с редьюсерами. В данном случае у нас есть один редьюсер:
// - Ключ todos — это имя части состояния в Redux store, которое будет связано с задачами.
// - Значение todoReducer — это сам редьюсер, который будет обрабатывать действия, относящиеся к задачам.

export default store;


// Этот код создает Redux store, который управляет состоянием задач (todos) в приложении. 
// Он использует @reduxjs/toolkit для упрощения процесса настройки и управления состоянием,
// а также импортирует редьюсер, который будет отвечать за логику работы с задачами.